Category.delete_all
Category.seed(:id,
  { :id => 1, :name => "サッカー", :detail => "サッカー　サッカー　サッカー　サッカー　サッカー　サッカー　サッカー　サッカー　サッカー　サッカー　サッカー　サッカー　サッカー　サッカー"},
  { :id => 2, :name => "フットサル", :detail => "フットサル　フットサル　フットサル　フットサル　フットサル　フットサル　フットサル　フットサル　フットサル　フットサル　フットサル　フットサル　フットサル　フットサル"},
  { :id => 3, :name => "バスケットボール", :detail => "バスケットボール　バスケットボール　バスケットボール　バスケットボール　バスケットボール　バスケットボール　バスケットボール　バスケットボール　バスケットボール　バスケットボール　バスケットボール　バスケットボール　バスケットボール　バスケットボール"},
  { :id => 4, :name => "テニス", :detail => "テニス　テニス　テニス　テニス　テニス　テニス　テニス　テニス　テニス　テニス　テニス　テニス　テニス　テニス"},
  { :id => 5, :name => "麻雀", :detail => "麻雀　麻雀　麻雀　麻雀　麻雀　麻雀　麻雀　麻雀　麻雀　麻雀　麻雀　麻雀　麻雀　麻雀"},
  { :id => 6, :name => "卓球", :detail => "サッカー　サッカー　サッカー　サッカー　サッカー　サッカー　サッカー　サッカー　サッカー　サッカー　サッカー　サッカー　サッカー　サッカー"},
  { :id => 7, :name => "バトミントン", :detail => "バトミントン　バトミントン　バトミントン　バトミントン　バトミントン　バトミントン　バトミントン　バトミントン　バトミントン　バトミントン　バトミントン　バトミントン　バトミントン　バトミントン"},
  { :id => 8, :name => "バレーボール", :detail => "バレーボール　バレーボール　バレーボール　バレーボール　バレーボール　バレーボール　バレーボール　バレーボール　バレーボール　バレーボール　バレーボール　バレーボール　バレーボール　バレーボール"},
  { :id => 9, :name => "ビリヤード", :detail => "ビリヤード　ビリヤード　ビリヤード　ビリヤード　ビリヤード　ビリヤード　ビリヤード　ビリヤード　ビリヤード　ビリヤード　ビリヤード　ビリヤード　ビリヤード　ビリヤード"},
  { :id => 10, :name => "ダーツ", :detail => "ダーツ　ダーツ　ダーツ　ダーツ　ダーツ　ダーツ　ダーツ　ダーツ　ダーツ　ダーツ　ダーツ　ダーツ　ダーツ　ダーツ"}
 )